; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v4 - type_2 ?v6 - type_1)
 	      (pred_3 ?v8 - object ?v6 - type_1)
	      (pred_2 ?v4 - type_2 ?v3 - type_3)
	      (pred_4 ?v4 - type_2 ?v8 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v4 - type_2 ?v2 ?v1 - type_1)
       :precondition (and  (pred_1 ?v4 ?v2))
       :effect (and  (pred_1 ?v4 ?v1)
		     (not (pred_1 ?v4 ?v2))))

   (:action op_2
       :parameters (?v4 - type_2 ?v5 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v7) (pred_1 ?v4 ?v7) (pred_2 ?v4 ?v3))
       :effect (and (pred_4 ?v4 ?v5 ?v3)
		    (not (pred_3 ?v5 ?v7)) 
		    (not (pred_2 ?v4 ?v3))))

   (:action op_1
       :parameters (?v4 - type_2 ?v5 - object ?v7 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v4 ?v5 ?v3) (pred_1 ?v4 ?v7))
       :effect (and (pred_3 ?v5 ?v7)
		    (pred_2 ?v4 ?v3)
		    (not (pred_4 ?v4 ?v5 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_04 - type_2
obj_08 obj_03 obj_13 obj_01 - type_3
obj_05 obj_10 obj_09 obj_06 - type_1
obj_12 obj_02 obj_14 obj_11 - object)
(:init
(pred_1 obj_07 obj_06)
(pred_2 obj_07 obj_08)
(pred_2 obj_07 obj_03)
(pred_1 obj_04 obj_09)
(pred_2 obj_04 obj_13)
(pred_2 obj_04 obj_01)
(pred_3 obj_12 obj_05)
(pred_3 obj_02 obj_05)
(pred_3 obj_14 obj_05)
(pred_3 obj_11 obj_09)
)
(:goal
(and
(pred_3 obj_12 obj_05)
(pred_3 obj_02 obj_10)
(pred_3 obj_14 obj_09)
(pred_3 obj_11 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_07 obj_09) (pred_1 obj_04 obj_09))))
  )
)
)

; plan
1. (op_3 obj_07 obj_06 obj_10)
   deleted: (pred_1 obj_07 obj_06)
   added: (pred_1 obj_07 obj_10)
   goals met: 2 of 4
2. (op_3 obj_04 obj_09 obj_05)
   deleted: (pred_1 obj_04 obj_09)
   added: (pred_1 obj_04 obj_05)
   goals met: 2 of 4
3. (op_2 obj_04 obj_14 obj_05 obj_01)
   deleted: (pred_3 obj_14 obj_05) (pred_2 obj_04 obj_01)
   added: (pred_4 obj_04 obj_14 obj_01)
   goals met: 2 of 4
4. (op_2 obj_04 obj_02 obj_05 obj_13)
   deleted: (pred_3 obj_02 obj_05) (pred_2 obj_04 obj_13)
   added: (pred_4 obj_04 obj_02 obj_13)
   goals met: 2 of 4
5. (op_3 obj_04 obj_05 obj_10)
   deleted: (pred_1 obj_04 obj_05)
   added: (pred_1 obj_04 obj_10)
   goals met: 2 of 4
6. (op_1 obj_04 obj_02 obj_10 obj_13)
   deleted: (pred_4 obj_04 obj_02 obj_13)
   added: (pred_3 obj_02 obj_10) (pred_2 obj_04 obj_13)
   goals met: 3 of 4
7. (op_3 obj_04 obj_10 obj_09)
   deleted: (pred_1 obj_04 obj_10)
   added: (pred_1 obj_04 obj_09)
   goals met: 3 of 4
8. (op_1 obj_04 obj_14 obj_09 obj_01)
   deleted: (pred_4 obj_04 obj_14 obj_01)
   added: (pred_3 obj_14 obj_09) (pred_2 obj_04 obj_01)
   goals met: 4 of 4
